#include <stdio.h>

const int n = 6;
//квадратная матрица, кол-во строк в ней 
//соответствует кол-ву вершин графа
//если у вершины i есть есть ребро к вершине j
//то ячека matrix[i][j] будет равна 1
//в противном случае 0
int matrix[n][n] = {
    {0, 1, 1, 0, 0, 0},
    {0, 0, 0, 1, 1, 1},
    {0, 0, 0, 0, 0, 0},
    {1, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 1, 0}
};
/*const int z=14;
int matriz[z][z] = {
    {0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0},
    {1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0},
    {0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0},
    {1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0},
    {0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0},
    {0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0},
    {0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0},
    {0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1},
    {0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0}
};*/

int visited1[n];

depthTravers(int st){
    int r;
    printf("%d ", st);
    visited1[st]=1;
    for(r=0; r<n; ++r){
        if (matrix[st][r] == 1 && !visited1[r]){
            depthTravers(r);//рекурсивный запуск функии обхода не посещенных соседних(соеденённых) вершин
        }
    }
}
void resetArr(){
    for (int i = 0; i<n; ++i){
        visited1[i]=0;
    }
}
int main(int argc, const char** argv){
    resetArr();
    depthTravers(0);
    resetArr();
    printf("\n");
    depthTravers(2);
    resetArr();
    printf("\n");
    depthTravers(1);
    resetArr();
    printf("\n");
    return 0;
}